# Напишите программу, которая считает длины катета и высоты в прямоугольном треугольнике и выводит его площадь.
# Площадь треугольника   (S = 1/2 * основание * высоту)
# Каждое число записано в отдельной строке  
# Числа d и h можно считывать так:

b = int(input('Введите b: '))
h = int(input('Введите h: '))
# Выводите результат через print():
area = (1/2)* b*h 
print(area)     


# a = int(input('Введите а: '))    # 5
# b = int(input('Введите b: '))    # 12
# # s = 1/2 * a * b
# # print(f'S = ', s)
# print(f'S={1/2*a*b}')
