# Напишите программу, которая считает длины катета и высоты в прямоугольном треугольнике и выводит его площадь.
#  Каждое число записано в отдельной строке   S = 1/2 * основание * высоту
# Числа d и h можно считывать так:
b = int(input())
h = int(input())
# Выводите результат через print():
area = (1/2)* b*h 
print(area)

# a = int(input('Введите а: ')) # 5
# b = int(input('Введите b: ')) # 12
# print(f'S={1/2*a*b}')
