# Напишите программу, в которой пользователь будет задавать 2 строки, а программа определять количество вхождений одной строки в другой

##############################################################

str = input('Введите первую строку для проверки:')
str = input('Введите вторую строку для поиска первой строки:')

print('Вторая строка входит в первую{str1.count(str2)} раз(a).')
