# Задайте список из n чисел последовательности $(1+\frac 1 n)^n$ и выведите на экран их сумму.
# Пример:
# Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}

N = int(input('Введите N: '))
list = []
for i in range(N):
    list.append(round((1 + 1/(i + 1))**(i + 1)))
print(list)
sum = 0
for i in list:
    sum += i
print(f'Сумма чисел последовательности равна:', sum)