# Найти корни квадратных уравнений.
###########################################################

# с помощью математических формул нахождения корней квадратного уравнения
from math import sqrt
a = int(input('Введите коэффициент а: '))
b = int(input('Введите коэффициент b: '))
c = int(input('Введите коэффициент c: '))
D = b**2 - 4 * a * c
if D > 0:
    x1 = (-b + sqrt(D)) / 2 * a
    x2 = (-b - sqrt(D)) / 2 * a
    print(f'Первый корень равен: {x1}')
    print(f'Второй корень равен: {x2}')
elif D == 0:
    x1 = -b / 2 * a
    print(f'Корень равен: {x1}')
else:
    print('Корней нет!')

##########################################################

# # ax**2 + b*x + c = 0
# a = -2
# b = 2
# c = 1
# disc = b**2 - 4 * a * c    #  Дискриминант
# if a == 0:
#     x = -c/b
#     print(x)
# elif disc > 0:
#     x1 = (-b - disc**0.5) / (2 * a)
#     x2 = (-b + disc**0.5) / (2 * a)
#     print(x1, x2)
# elif not disc:
#     x = -b/(2 * a)
#     print(x)
# else: print('Нет вещественных корней')   #  1.3660254037844386 -0.3660254037844386
